{"zip":"98052-6399","sector":"Technology","fullTimeEmployees":181000,"longBusinessSummary":"Microsoft Corporation develops, licenses, and supports software, services, devices, and solutions worldwide. Its Productivity and Business Processes segment offers Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, and Skype for Business, as well as related Client Access Licenses (CAL); Skype, Outlook.com, OneDrive, and LinkedIn; and Dynamics 365, a set of cloud-based and on-premises business solutions for organizations and enterprise divisions. Its Intelligent Cloud segment licenses SQL, Windows Servers, Visual Studio, System Center, and related CALs; GitHub that provides a collaboration platform and code hosting service for developers; and Azure, a cloud platform. It also offers support services and Microsoft consulting services to assist customers in developing, deploying, and managing Microsoft server and desktop solutions; and training and certification on Microsoft products. Its More Personal Computing segment provides Windows original equipment manufacturer (OEM) licensing and other non-volume licensing of the Windows operating system; Windows Commercial, such as volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings; patent licensing; Windows Internet of Things; and MSN advertising. It also offers Surface, PC accessories, PCs, tablets, gaming and entertainment consoles, and other devices; Gaming, including Xbox hardware, and Xbox content and services; video games and third-party video game royalties; and Search, including Bing and Microsoft advertising. It sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online stores, and retail stores. It has collaborations with Dynatrace, Inc., Morgan Stanley, Micro Focus, WPP plc, ACI Worldwide, Inc., and iCIMS, Inc., as well as strategic relationships with Avaya Holdings Corp. and wejo Limited. Microsoft Corporation was founded in 1975 and is based in Redmond, Washington.","city":"Redmond","phone":"425 882 8080","state":"WA","country":"United States","website":"https://www.microsoft.com","address1":"One Microsoft Way","industry":"Software Infrastructure","shortName":"Microsoft Corporation","longName":"Microsoft Corporation","symbol":"MSFT","logo_url":"https://logo.clearbit.com/microsoft.com"}
{"zip":"95014","sector":"Technology","fullTimeEmployees":100000,"longBusinessSummary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. It also sells various related services. In addition, the company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; AirPods Max, an over-ear wireless headphone; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, HomePod, and iPod touch. Further, it provides AppleCare support services; cloud services store services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts. Additionally, the company offers various services, such as Apple Arcade, a game subscription service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was incorporated in 1977 and is headquartered in Cupertino, California.","city":"Cupertino","phone":"408 996 1010","state":"CA","country":"United States","website":"https://www.apple.com","address1":"One Apple Park Way","industry":"Consumer Electronics","shortName":"Apple Inc.","longName":"Apple Inc.","symbol":"AAPL","logo_url":"https://logo.clearbit.com/apple.com"}
{"zip":"94043","sector":"Communication Services","fullTimeEmployees":156500,"longBusinessSummary":"Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, Google Maps, Google Play, Search, and YouTube; subscription-based products; and Fitbit wearable devices, Google Nest home products, Pixel phones, and other devices, as well as in-app purchases and digital content. The Google Cloud segment offers infrastructure, platform, and other services; Google Workspace that include cloud-based collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar and Meet; and other services for enterprise customers. The Other Bets segment sells health technology and internet services, as well as licensing and research and development services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","city":"Mountain View","phone":"650 253 0000","state":"CA","country":"United States","website":"https://www.abc.xyz","address1":"1600 Amphitheatre Parkway","industry":"Internet Content & Information","shortName":"Alphabet Inc.","longName":"Alphabet Inc.","symbol":"GOOGL","logo_url":"https://logo.clearbit.com/abc.xyz"}
{"zip":"75039-2298","sector":"Energy","longBusinessSummary":"Exxon Mobil Corporation explores for and produces crude oil and natural gas in the United States and internationally. It operates through Upstream, Downstream, and Chemical segments. The company is also involved in the manufacture, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and manufactures and sells petrochemicals, including olefins, polyolefins, aromatics, and various other petrochemicals. As of December 31, 2020, it had approximately 22,239 net operated wells with proved reserves. The company was founded in 1870 and is based in Irving, Texas.","city":"Irving","phone":"972-940-6000","state":"TX","country":"United States","website":"https://corporate.exxonmobil.com","address1":"5959 Las Colinas Boulevard","fax":"972-940-6143","industry":"Oil & Gas Integrated","shortName":"Exxon Mobil Corporation","longName":"Exxon Mobil Corporation","symbol":"XOM","logo_url":"https://logo.clearbit.com/corporate.exxonmobil.com"}
{"zip":"10018","sector":"Technology","longBusinessSummary":"Datadog, Inc. provides monitoring and analytics platform for developers, information technology operations teams, and business users in the cloud in North America and internationally. The company's SaaS platform integrates and automates infrastructure monitoring, application performance monitoring, log management, and security monitoring to provide real-time observability of customers technology stack. Its platform also provides user experience and network performance monitoring, incident management, and various shared features, such as sophisticated dashboards, advanced analytics, collaboration tools, and alerting capabilities. The company was incorporated in 2010 and is headquartered in New York, New York.","city":"New York","phone":"866 329 4466","state":"NY","country":"United States","website":"https://www.datadoghq.com","address1":"620 8th Avenue","industry":"Software Application","address2":"45th Floor","shortName":"Datadog, Inc.","longName":"Datadog, Inc.","symbol":"DDOG","logo_url":"https://logo.clearbit.com/datadoghq.com"}
{"zip":"94158","sector":"Technology","longBusinessSummary":"Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. It connects consumers with independent providers of ride services for ridesharing services and other forms of transportation services, including public transit, as well as connect riders and other consumers with restaurants, grocers, other stores, and delivery service providers for meal preparation, grocery, and other delivery services. The company operates through four segments: Mobility, Delivery, Freight, and Advanced Technologies Group (ATG) and Other Technology Programs. The Mobility segment provides products that connect consumers with mobility drivers who provide rides in a range of vehicles, such as cars, auto rickshaws, motorbikes, minibuses, or taxis. It also offers Uber for Business, financial partnerships, transit, and vehicle solutions offerings. The Delivery segment allows consumers to search for and discover local restaurants, order a meal, and either pick-up at the restaurant or have the meal delivered, as well as offers grocery and convenience store delivery, and select other goods. The Freight segment connects carriers with shippers on the company's platform and enable carriers upfront, transparent pricing, and the ability to book a shipment. The ATG and Other Technology Programs segment engages in the development and commercialization of autonomous vehicle and ridesharing technologies, as well as Uber Elevate. It has a partnership with DriverDO LLC that allows automotive software companies to offer vehicle logistics and personal mobility. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.","city":"San Francisco","phone":"415 612 8582","state":"CA","country":"United States","website":"https://www.uber.com","address1":"1515 3rd Street","industry":"Software Application","shortName":"Uber Technologies, Inc.","longName":"Uber Technologies, Inc.","symbol":"UBER","logo_url":"https://logo.clearbit.com/uber.com"}
{"zip":"95052-3299","sector":"Technology","fullTimeEmployees":28500,"longBusinessSummary":"Applied Materials, Inc. provides manufacturing equipment, services, and software to the semiconductor, display, and related industries. It operates through three segments: Semiconductor Systems, Applied Global Services, and Display and Adjacent Markets. The Semiconductor Systems segment develops, manufactures, and sells various manufacturing equipment that is used to fabricate semiconductor chips or integrated circuits. This segment also offers various technologies, including epitaxy, ion implantation, oxidation/nitridation, rapid thermal processing, physical vapor deposition, chemical vapor deposition, chemical mechanical planarization, electrochemical deposition, atomic layer deposition, etching, and selective deposition and removal, as well as metrology and inspection tools. The Applied Global Services segment provides integrated solutions to optimize equipment and fab performance and productivity comprising spares, upgrades, services, remanufactured earlier generation equipment, and factory automation software for semiconductor, display, and other products. The Display and Adjacent Markets segment offers products for manufacturing liquid crystal displays; organic light-emitting diodes; and other display technologies for TVs, monitors, laptops, personal computers, electronic tablets, smart phones, and other consumer-oriented devices. The company operates in the United States, China, Korea, Taiwan, Japan, Southeast Asia, and Europe. Applied Materials, Inc. was incorporated in 1967 and is headquartered in Santa Clara, California.","city":"Santa Clara","phone":"408 727 5555","state":"CA","country":"United States","website":"https://www.appliedmaterials.com","address1":"3050 Bowers Avenue","industry":"Semiconductor Equipment & Materials","address2":"PO Box 58039","shortName":"Applied Materials, Inc.","longName":"Applied Materials, Inc.","symbol":"AMAT","logo_url":"https://logo.clearbit.com/appliedmaterials.com"}
{"zip":"94025","sector":"Technology","longBusinessSummary":"Robinhood Markets, Inc. operates financial services platform in the United States. Its platform allows users to invest in stocks, exchange-traded funds (ETFs), options, gold, and cryptocurrencies. The company also offers various learning and education solutions comprise Snacks, a digest of business news stories; Learn, which is a collection of approximately 650 articles, including guides, feature tutorials, and financial dictionary; Newsfeeds that offer access to free premium news from various sites, such as Barron's, Reuters, and The Wall Street Journal; and lists, which allow users to create custom watchlists to monitor securities, ETFs, and cryptocurrencies, as well as cash management services. Robinhood Markets, Inc. was incorporated in 2013 and is headquartered in Menlo Park, California.","city":"Menlo Park","phone":"844 428 5411","state":"CA","country":"United States","website":"https://www.robinhood.com","address1":"85 Willow Road","industry":"Software Infrastructure","shortName":"Robinhood Markets, Inc.","longName":"Robinhood Markets, Inc.","symbol":"HOOD","logo_url":"https://logo.clearbit.com/robinhood.com"}
{"zip":"98109-5210","sector":"Consumer Cyclical","fullTimeEmployees":1608000,"longBusinessSummary":"Amazon.com, Inc. engages in the retail sale of consumer products and subscriptions in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It sells merchandise and content purchased for resale from third-party sellers through physical and online stores. The company also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Rings, and Echo and other devices; provides Kindle Direct Publishing, an online service that allows independent authors and publishers to make their books available in the Kindle Store; and develops and produces media content. In addition, it offers programs that enable sellers to sell their products on its websites, as well as its stores; and programs that allow authors, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, the company provides compute, storage, database, analytics, machine learning, and other services, as well as fulfillment, advertising, publishing, and digital content subscriptions. Additionally, it offers Amazon Prime, a membership program, which provides free shipping of various items; access to streaming of movies and series; and other services. The company serves consumers, sellers, developers, enterprises, and content creators. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.","city":"Seattle","phone":"206 266 1000","state":"WA","country":"United States","website":"https://www.amazon.com","address1":"410 Terry Avenue North","industry":"Internet Retail","shortName":"Amazon.com, Inc.","longName":"Amazon.com, Inc.","symbol":"AMZN","logo_url":"https://logo.clearbit.com/amazon.com"}
{"zip":"95051","sector":"Technology","longBusinessSummary":"NVIDIA Corporation operates as a visual computing company worldwide. It operates in two segments, Graphics and Compute & Networking. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise design; GRID software for cloud-based visual and virtual computing; and automotive platforms for infotainment systems. The Compute & Networking segment offers Data Center platforms and systems for AI, HPC, and accelerated computing; Mellanox networking and interconnect solutions; automotive AI Cockpit, autonomous driving development agreements, and autonomous vehicle solutions; and Jetson for robotics and other embedded platforms. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers/distributors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. NVIDIA has partnership with Google Cloud to create AI-on-5G Lab. NVIDIA Corporation was founded in 1993 and is headquartered in Santa Clara, California.","city":"Santa Clara","phone":"408 486 2000","state":"CA","country":"United States","website":"https://www.nvidia.com","address1":"2788 San Tomas Expressway","industry":"Semiconductors","shortName":"NVIDIA Corporation","longName":"NVIDIA Corporation","symbol":"NVDA","logo_url":"https://logo.clearbit.com/nvidia.com"}
{"zip":"10504","sector":"Technology","longBusinessSummary":"International Business Machines Corporation provides integrated solutions and services worldwide. Its Cloud & Cognitive Software segment offers software for vertical and domain-specific solutions in various application areas; and customer information control system and storage, and analytics and integration software solutions to support client mission on-premise workloads in banking, airline, and retail industries. It offers middleware and data platform software, including Red Hat that enables the operation of clients' hybrid multi-cloud environments; and Cloud Paks, WebSphere distributed, and analytics platform software, such as DB2 distributed, information integration, and enterprise content management, as well as IoT, Blockchain and AI/Watson platforms. The company's Global Business Services segment offers business consulting services; system integration, application management, maintenance, and support services for packaged software; and finance, procurement, talent and engagement, and industry-specific business process outsourcing services. Its Global Technology Services segment provides IT infrastructure and platform services; and project, managed, outsourcing, and cloud-delivered services for enterprise IT infrastructure environments; and IT infrastructure support services. The company's Systems segment offers servers for businesses, cloud service providers, and scientific computing organizations; data storage products and solutions; and z/OS, an enterprise operating system, as well as Linux. Its Global Financing segment provides lease, installment payment, loan financing, short-term working capital financing, and remanufacturing and remarketing services. It has a collaboration with GK Software SE to enhance retail innovation and customer omnichannel experience with hybrid cloud technology; and with Apptio, Inc. The company was formerly known as Computing-Tabulating-Recording Co. The company was incorporated in 1911 and is headquartered in Armonk, New York.","city":"Armonk","phone":"914 499 1900","state":"NY","country":"United States","website":"https://www.ibm.com","address1":"One New Orchard Road","industry":"Information Technology Services","shortName":"International Business Machines","longName":"International Business Machines Corporation","symbol":"IBM","logo_url":"https://logo.clearbit.com/ibm.com"}
{"zip":"10282","sector":"Financial Services","fullTimeEmployees":43900,"longBusinessSummary":"The Goldman Sachs Group, Inc., a financial institution, provides range of financial services for corporations, financial institutions, governments, and individuals worldwide. It operates through four segments: Investment Banking, Global Markets, Asset Management, and Consumer & Wealth Management. The company's Investment Banking segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, corporate defense activities, restructurings, and spin-offs; and middle-market lending, relationship lending, and acquisition financing, as well as transaction banking services. This segment also offers underwriting services, such as equity underwriting for common and preferred stock and convertible and exchangeable securities; and debt underwriting for various types of debt instruments, including investment-grade and high-yield debt, bank and bridge loans, and emerging- and growth-market debt, as well as originates structured securities. Its Global Markets segment is involved in client execution activities for cash and derivative instruments; credit and interest rate products; and provision of equity intermediation and equity financing, clearing, settlement, and custody services, as well as mortgages, currencies, commodities, and equities related products. The company's Asset Management segment manages assets across various asset classes, including equity, fixed income, hedge funds, credit funds, private equity, real estate, currencies, and commodities; and provides customized investment advisory solutions, as well as invests in corporate, real estate, and infrastructure entities. Its Consumer & Wealth Management segment offers wealth advisory and banking services, including financial planning, investment management, deposit taking, and lending; private banking; and unsecured loans, as well as accepts saving and time deposits. The company was founded in 1869 and is headquartered in New York, New York.","city":"New York","phone":"212-902-1000","state":"NY","country":"United States","website":"https://www.goldmansachs.com","address1":"200 West Street","industry":"Capital Markets","address2":"29th Floor","shortName":"Goldman Sachs Group, Inc. (The)","longName":"The Goldman Sachs Group, Inc.","symbol":"GS","logo_url":"https://logo.clearbit.com/goldmansachs.com"}
{"zip":"59715","sector":"Technology","fullTimeEmployees":3557,"longBusinessSummary":"Snowflake Inc. provides cloud-based data platform in the United States and internationally. The company's platform offers Data Cloud, an ecosystem that enables customers to consolidate data into a single source of truth to drive meaningful business insights, build data-driven applications, and share data. Its platform is used by various organizations of various sizes in a range of industries. The company was formerly known as Snowflake Computing, Inc. and changed its name to Snowflake Inc. in April 2019. Snowflake Inc. was incorporated in 2012 and is based in Bozeman, Montana.","city":"Bozeman","phone":"844 766 9355","state":"MT","country":"United States","website":"https://www.snowflake.com","address1":"106 East Babcock Street","industry":"Software Application","address2":"Suite 3A","shortName":"Snowflake Inc.","longName":"Snowflake Inc.","symbol":"SNOW","logo_url":"https://logo.clearbit.com/snowflake.com"}
{"zip":"92618","sector":"Consumer Cyclical","fullTimeEmployees":7500,"longBusinessSummary":"Rivian Automotive, Inc. develops and manufactures electric adventure vehicles. It offers five-passenger pickup trucks and sports utility vehicles. The company provides electric SUVs and electric pickup vehicles. The company was founded in 2009 and is based in San Jose, California. It has additional facilities in Irvine, Carson, and Palo Alto, California; Normal, Illinois; Woking, United Kingdom; Plymouth, Michigan; Vancouver, Canada; and Wittman, Arizona.","city":"Irvine","phone":"734 855 4350","state":"CA","country":"United States","website":"https://www.rivian.com","address1":"14600 Myford Road","industry":"Auto Manufacturers","shortName":"Rivian Automotive, Inc.","longName":"Rivian Automotive, Inc.","symbol":"RIVN","logo_url":"https://logo.clearbit.com/rivian.com"}
{"shortName":"Vanguard S&P 500 ETF","longName":"Vanguard S&P 500 ETF","symbol":"VOO","phone":"866-499-8473","longBusinessSummary":"The investment seeks to track the performance of the Standard & Poorâ\u0080\u0098s 500 Index that measures the investment return of large-capitalization stocks.\n The fund employs an indexing investment approach designed to track the performance of the Standard & Poor&#39;s 500 Index, a widely recognized benchmark of U.S. stock market performance that is dominated by the stocks of large U.S. companies. The advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.","logo_url":""}
{"zip":"94103","sector":"Technology","longBusinessSummary":"Samsara Inc. provides solutions that connects physical operations data to its Connected Operations Cloud in the United States and internationally. The company's Connected Operations Cloud includes Data Platform, which ingests, aggregates, and enriches data from its IoT devices and has embedded capabilities for AI, workflows and analytics, alerts, API connections, and data security and privacy; and applications for video-based safety, vehicle telematics, apps and driver workflows, equipment monitoring, and site visibility. It serves customers across a range of industries, including transportation and logistics, construction, field services, utilities and energy, government, healthcare and education, manufacturing, and food and beverage. The company was founded in 2015 and is based in San Francisco, California.","city":"San Francisco","phone":"415-985-2400","state":"CA","country":"United States","website":"https://www.samsara.com","address1":"South Building","industry":"Software Infrastructure","address2":"4th Floor 350 Rhode Island Street","shortName":"Samsara Inc.","longName":"Samsara Inc.","symbol":"IOT","logo_url":"https://logo.clearbit.com/samsara.com"}
